<!DOCTYPE HTML-->
<html lang ="pt">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

<head>
<title>x window</title>
<meta name="author" content="Unknown" >
<META NAME="keywords" CONTENT="linux">
<META NAME="description" CONTENT="x window">
<link rel="stylesheet" type="text/css" href="verbete.css">
</head>

<body>
<a name="inicio"></a>

<h1>X Window</h1>

<h2>Defini&ccedil;&atilde;o</h2>

<p>O sistema X Window &eacute; um protocolo com um conjunto de rotinas de tratamento de tela padronizadas que permite a cria&ccedil;&atilde;o de interfaces gr&aacute;ficas independente do hardware, ou seja, ele pode ser utilizado em diferentes tipos de m&aacute;quinas e plataformas Unix. Isto se d&aacute; pois o monitor do usu&aacute;rio n&atilde;o se comunica diretamente com as aplica&ccedil;&otilde;es, o dado tem que passar pelo tratamento de convers&atilde;o de padr&atilde;o do sistema X e s&oacute; ent&atilde;o este dado chegar&aacute; at&eacute; a aplica&ccedil;&atilde;o.</p>
<p>Assim o mesmo programa pode ser executado sobre qualquer hardware sem ser recompilado ou modificado.</p>

<! -------------------------------------------------------------------------------------------- -->
<h2>Sistema X em rede</h2>
<p>Com o sistema X v&aacute;rios programas, que podem estar rodando em m&aacute;quinas pela internet, geram simultaneamente texto e gr&aacute;ficos na tela de um determinado usu&aacute;rio.</p>
<p>Em geral sistema X &eacute; dividido em servidor X e cliente X.</p>
<p>O servidor X &eacute; o programa que controla a exibi&ccedil;&atilde;o de gr&aacute;ficos em tela, mouse e teclado. Ele se comunica com os programas clientes atrav&eacute;s de v&aacute;rios m&eacute;todos de comunica&ccedil;&atilde;o.</p>
<p>O cliente X &eacute; simplesmente onde o programa est&aacute; sendo executado, o qual pode ser na mesma m&aacute;quina que do servidor X ou em uma m&aacute;quina remota.</p>
<p>Com a capacidade de funcionamento em rede, podemos fazer com que uma m&aacute;quina execute o trabalho e mostre o resultado em outra, ou seja, o sistema X deixa uma m&aacute;quina livre (m&aacute;quina sevidor X) enquanto outra faz todo o trabalho (m&aacute;quina cliente X).</p>

<! -------------------------------------------------------------------------------------------- -->
<h2>Gerenciador de Janelas</h2>
<p>Como em cima do protocolo X rodam todas as aplica&ccedil;&otilde;es, como o gerenciador de janelas n&atilde;o seria diferente. Eles s&atilde;o respons&aacute;veis por gerar a interface externa do sistema do usu&aacute;rio. O sistema X torna o gerenciador de janelas em um processo separado, assim o usu&aacute;rio pode escolher entre uma variedade de gerenciadores, como por exemplo o KDE e o mwm.</p>


<! -------------------------------------------------------------------------------------------- -->
<p>&nbsp;</p>
<table align="center" border=0 cellpadding=0 cellspacing=0>
<tr bgcolor="#E6E6FA">
<td align=center><font size=2 color="#00008B"><a href="#inicio">&nbsp;&nbsp;Topo&nbsp;&nbsp;</a></font></td>
<td align=center><font size=2 color="#00008B">  |  </td>
<td align=left><font size=2 color="#00008B"><a href="index.html">&nbsp;&nbsp;Guia&nbsp;&nbsp;</a></font></td>
<td align=center><font size=2 color="#00008B">  |   </td>
</tr><tr>
<td colspan=5 >&nbsp;</td>
</tr><tr>
<td colspan=5 align="center"><font size=1 color="#994C00"><script type="text/javascript" src="data_atualizacao.js"></script></td>
</tr>
</table>

<! -------------------------------------------------------------------------------------------- -->
</body>
</html>
